In [4]:
# ===============================
# 1. Connect to SQLite Database
# ===============================

import sqlite3
import pandas as pd

conn = sqlite3.connect("superstore.db")

cursor = conn.cursor()

In [5]:
# ===============================
# 2. Load Cleaned CSV into SQL
# ===============================

df = pd.read_csv("superstore_cleaned.csv")

df.to_sql("sales", conn, if_exists="replace", index=False)

print("Data successfully loaded into SQL database.")

Data successfully loaded into SQL database.

In [6]:
#Total Revenue

query = """
SELECT SUM(Sales) AS Total_Revenue
FROM sales;
"""

pd.read_sql(query, conn)

   Total_Revenue
0   2.261537e+06

In [7]:
#Profit Margin %

query = """
SELECT 
    (SUM(Profit) * 100.0 / SUM(Sales)) AS Profit_Margin
FROM sales;
"""

pd.read_sql(query, conn)

   Profit_Margin
0      17.346265

In [8]:
#Revenue by Region

query = """
SELECT Region,
       SUM(Sales) AS Revenue
FROM sales
GROUP BY Region
ORDER BY Revenue DESC;
"""

pd.read_sql(query, conn)

    Region      Revenue
0     West  710219.6845
1     East  669518.7260
2  Central  492646.9132
3    South  389151.4590

In [9]:
#Churn Rate

query = """
SELECT 
    (COUNT(DISTINCT CASE WHEN "Churn Flag" = 1 THEN "Customer ID" END) * 100.0
     / COUNT(DISTINCT "Customer ID")) AS Churn_Rate
FROM sales;
"""

pd.read_sql(query, conn)

   Churn_Rate
0   25.472888

In [10]:
#Top 10 Customers

query = """
SELECT "Customer Name",
       SUM(Sales) AS Revenue
FROM sales
GROUP BY "Customer Name"
ORDER BY Revenue DESC
LIMIT 10;
"""

pd.read_sql(query, conn)

        Customer Name    Revenue
0         Sean Miller  25043.050
1        Tamara Chand  19052.218
2        Raymond Buch  15117.339
3        Tom Ashbrook  14595.620
4       Adrian Barton  14473.571
5        Ken Lonsdale  14175.229
6        Sanjit Chand  14142.334
7        Hunter Lopez  12873.298
8        Sanjit Engle  12209.438
9  Christopher Conant  12129.072